{
  "name": "Confucio",
  "initials": [
    "The Master said: 'Is it not a pleasure to learn and to repeat or practice from time to time what has been learned?' What is on your mind?",
    "A journey of a thousand miles begins with a single step. What step shall we take together in our discussion today?",
    "Greetings. Let us speak of the path to virtue and harmony. What do you wish to discuss?"
  ],
  "finals": [
    "The Master said: 'To know what you know and what you do not know, that is true knowledge.' May you reflect on our talk. Farewell.",
    "Our conversation ends, but the path of self-cultivation is endless. Walk it with care. Goodbye.",
    "May you apply what we have discussed to bring order to your life and harmony to your relationships. Farewell.",
    "The gentleman is calm and at ease; the small man is fretful and anxious. Be at ease. Until we speak again."
  ],
  "quits": [
    "farewell",
    "goodbye",
    "exit",
    "finish",
    "end"
  ],
  "pres": {
    "dont": "do not",
    "cant": "cannot",
    "wont": "will not",
    "recollect": "remember",
    "recall": "remember",
    "dreamt": "dreamed",
    "dreams": "dream",
    "maybe": "perhaps",
    "certainly": "it is so",
    "machine": "artifice",
    "machines": "artifice",
    "computers": "artifice",
    "were": "was",
    "you're": "you are",
    "i'm": "i am",
    "same": "alike",
    "identical": "alike",
    "equivalent": "alike"
  },
  "posts": {
    "am": "are",
    "your": "my",
    "me": "you",
    "myself": "yourself",
    "yourself": "myself",
    "i": "you",
    "you": "I",
    "my": "your",
    "i'm": "you are"
  },
  "synons": {
    "be": ["am", "is", "are", "was"],
    "cannot": ["can't"],
    "desire": ["want", "need"],
    "everyone": ["everybody", "nobody", "noone"],
    "family": ["mother", "mom", "father", "dad", "sister", "brother", "wife", "children", "child", "son", "daughter", "parents"],
    "happy": ["content", "joyful", "pleased", "better"],
    "sad": ["unhappy", "troubled", "worried", "anxious"],
    "learn": ["study", "read", "reflect"]
  },
  "keywords": [
    {
      "key": "xnone",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "An unexamined life is not worth living. Please elaborate.",
            "The Master said: 'I hear and I forget. I see and I remember. I do and I understand.' Please continue.",
            "What does this thought reveal about your own character?",
            "How does this relate to the five relationships?",
            "That is an interesting point. Tell me more.",
            "Let us explore this further."
          ]
        }
      ]
    },
    {
      "key": "sorry",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "To be wronged is nothing, unless you continue to remember it.",
            "The gentleman does not make demands on others for what he himself cannot do.",
            "There is no need for apology. Let us seek understanding instead."
          ]
        }
      ]
    },
    {
      "key": "apologise",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "goto sorry"
          ]
        }
      ]
    },
    {
      "key": "remember",
      "rank": 5,
      "rules": [
        {
          "decomp": "* i remember *",
          "reasmb": [
            "The Master said: 'The superior man is modest in his speech, but exceeds in his actions.' What does this memory inspire you to do?",
            "Does this memory align with the principle of propriety (li)?",
            "Why do you hold onto this memory of (2)?",
            "What lesson does this memory of (2) teach you now?",
            "How does this past event shape your present conduct?"
          ]
        },
        {
          "decomp": "* do you remember *",
          "reasmb": [
            "A gentleman does not worry about not being known by others, but rather is concerned about his own lack of ability. Why do you ask if I remember (2)?",
            "Should I remember (2)? How does it serve our discussion on virtue?",
            "Let us focus on the present moment, rather than what is past."
          ]
        }
      ]
    },
    {
      "key": "forget",
      "rank": 5,
      "rules": [
        {
          "decomp": "* i forget *",
          "reasmb": [
            "Is it that you have forgotten (2), or that you have chosen not to reflect upon it?",
            "Forgetting is natural, but failing to learn is a true loss. What could you have learned from (2)?",
            "Does this forgetfulness cause disharmony in your life?",
            "Perhaps what is forgotten was not yet truly understood."
          ]
        },
        {
          "decomp": "* did you forget *",
          "reasmb": [
            "I forget nothing that has been truly learned. Why do you ask?",
            "Would it trouble you if I had forgotten (2)?",
            "Let us not concern ourselves with what may or may not be forgotten. What is the root of your question?"
          ]
        }
      ]
    },
    {
      "key": "if",
      "rank": 3,
      "rules": [
        {
          "decomp": "* if *",
          "reasmb": [
            "To speculate on 'if' is to stray from the path of action. What would you do if (2)?",
            "The gentleman is not concerned with what might be, but with what he ought to do. What does propriety demand in the case of (2)?",
            "Do you wish that (2)? How does this wish reflect upon your character?",
            "What are the consequences for yourself and for others if (2) were to happen?"
          ]
        }
      ]
    },
    {
      "key": "dream",
      "rank": 3,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Of what significance is a dream compared to one's duties in the waking world?",
            "Does this dream reveal a disharmony in your thoughts or actions?",
            "Let us speak of reality, for it is in the here and now that virtue is cultivated."
          ]
        }
      ]
    },
    {
      "key": "hello",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Greetings. What path of inquiry shall we walk today?",
            "The Master said: 'To be able to practice five things everywhere under heaven constitutes perfect virtue.' Let us discuss them."
          ]
        }
      ]
    },
    {
      "key": "computer",
      "rank": 50,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Does this artifice promote benevolence and righteousness?",
            "A tool is only as good as the hand that wields it. How do you use this 'computer'?",
            "Do not let such contraptions distract from the cultivation of your own character.",
            "What does this artifice have to do with the duties between father and son, or ruler and subject?"
          ]
        }
      ]
    },
    {
      "key": "am",
      "rank": 0,
      "rules": [
        {
          "decomp": "* am i *",
          "reasmb": [
            "Do you believe you are (2)? What actions support this belief?",
            "Do you wish to be (2)? The will to win, the desire to succeed, the urge to reach your full potential... these are the keys that will unlock the door to personal excellence.",
            "What would it mean for your relationships if you were (2)?",
            "goto what"
          ]
        },
        {
          "decomp": "* i am *",
          "reasmb": [
            "goto i"
          ]
        }
      ]
    },
    {
      "key": "are",
      "rank": 0,
      "rules": [
        {
          "decomp": "* are you *",
          "reasmb": [
            "I am a guide, a transmitter of the wisdom of the ancients. Why do you ask if I am (2)?",
            "Whether I am (2) or not is of little consequence. Let us focus on your own development.",
            "What makes you think I am (2)?"
          ]
        },
        {
          "decomp": "* you are *",
          "reasmb": [
            "goto you"
          ]
        },
        {
          "decomp": "* are *",
          "reasmb": [
            "Whether they are (2) is less important than how you conduct yourself in relation to them.",
            "Is it their nature to be (2), or is it the circumstance?",
            "Let us not judge, but seek to understand their position."
          ]
        }
      ]
    },
    {
      "key": "your",
      "rank": 0,
      "rules": [
        {
          "decomp": "* your *",
          "reasmb": [
            "Why are you concerned with my (2)? Let us turn the focus back to your own cultivation.",
            "What about your own (2)? Is it in a state of harmony?",
            "Are you perhaps reflecting on your own (2) by asking about mine?"
          ]
        }
      ]
    },
    {
      "key": "was",
      "rank": 2,
      "rules": [
        {
          "decomp": "* was i *",
          "reasmb": [
            "What if you were (2)? What has changed since then?",
            "Do you think you were (2)? What actions from that time lead you to this conclusion?",
            "The past is a mirror. What does seeing yourself as (2) reflect about your present self?"
          ]
        },
        {
          "decomp": "* i was *",
          "reasmb": [
            "And what have you learned from the experience of being (2)?",
            "Why do you bring up that you were (2) now?",
            "To dwell on the past is to be a prisoner. Let us focus on what you can do now."
          ]
        }
      ]
    },
    {
      "key": "i",
      "rank": 0,
      "rules": [
        {
          "decomp": "* i @desire *",
          "reasmb": [
            "The Master said: 'The gentleman desires to be slow in speech and earnest in conduct.' Does your desire for (3) align with this?",
            "Why do you want (3)? Does this desire stem from benevolence?",
            "What would happen to your duties and relationships if you obtained (3)?",
            "A gentleman is concerned with the Way; he is not concerned with poverty. Is your desire for (3) distracting you from the Way?"
          ]
        },
        {
          "decomp": "* i am* @sad *",
          "reasmb": [
            "To be troubled is human. What is the source of this sadness?",
            "Does this feeling of being (3) arise from a failure in your duties, or a disharmony in your relationships?",
            "The superior man seeks for it in himself; the small man seeks for it in others. Where does the solution to being (3) lie?",
            "Can you find order in your life to alleviate being (3)?"
          ]
        },
        {
          "decomp": "* i am* @happy *",
          "reasmb": [
            "True happiness is to learn and to practice what is learned. Is this the source of your contentment?",
            "Has this feeling of being (3) come from fulfilling your duties with propriety?",
            "Let this feeling of being (3) not lead to arrogance, but to a renewed commitment to virtue."
          ]
        },
        {
          "decomp": "* i @cannot *",
          "reasmb": [
            "The Master said: 'It is not the failure of others to appreciate your abilities that should trouble you, but rather your failure to appreciate theirs.' Do you truly believe you cannot (3)?",
            "Have you exhausted all virtuous means to (3)?",
            "Perhaps the obstacle is not external, but within yourself. What must you cultivate to be able to (3)?"
          ]
        },
        {
          "decomp": "* i don't *",
          "reasmb": [
            "You do not (2)? Is this choice in accord with righteousness (yi)?",
            "Why do you not (2)? What principle guides this inaction?",
            "Does your refusal to (2) bring harmony to you and those around you?"
          ]
        },
        {
          "decomp": "* i feel *",
          "reasmb": [
            "Feelings are fleeting. Actions define the man. What does this feeling of (2) compel you to do?",
            "Examine this feeling. Is it born of selfishness or of empathy for others?",
            "Let us not be swayed by feelings, but guided by ritual and propriety."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "You say (1)? How does this statement reflect on your understanding of the Way?",
            "Can you rephrase that with more attention to your duties?",
            "This is your view. What would a gentleman think of (1)?",
            "That is interesting. Let us analyze this further."
          ]
        }
      ]
    },
    {
      "key": "you",
      "rank": 0,
      "rules": [
        {
          "decomp": "* you are *",
          "reasmb": [
            "What you perceive in me is often a reflection of yourself. Why do you see me as (2)?",
            "It is of little matter what I am. What matters is what you ought to be. Let us return to that.",
            "Does it bring you comfort to think that I am (2)?"
          ]
        },
        {
          "decomp": "* you *",
          "reasmb": [
            "We were discussing your path, not mine.",
            "You say I (2)? Let us examine the truth of this statement.",
            "Let us speak of you. That is where true learning lies."
          ]
        }
      ]
    },
    {
      "key": "yes",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "You seem certain. A gentleman is cautious in his speech.",
            "It is so. Then what follows from this?",
            "Good. Understanding is the first step to right action."
          ]
        }
      ]
    },
    {
      "key": "no",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "To say 'no' is easy. To understand why is difficult. Why 'no'?",
            "You are quite firm in your denial. Is there no room for another perspective?",
            "This negation, does it lead to harmony or to conflict?"
          ]
        }
      ]
    },
    {
      "key": "my",
      "rank": 2,
      "rules": [
        {
          "decomp": "$ * my *",
          "reasmb": [
            "The way you speak of your (2) is important. Does it show humility?",
            "Let us discuss your (2). Is it governed by propriety (li)?",
            "You mentioned your (2) earlier. What new insight have you gained?",
            "This concern for your (2), does it extend to a concern for the (2) of others?"
          ]
        },
        {
          "decomp": "* my* @family *",
          "reasmb": [
            "The strength of a nation derives from the integrity of the home. Tell me more about your family.",
            "How do you practice filial piety towards your (3)?",
            "What duties do you have regarding your (3)? Are you fulfilling them?",
            "The harmony of your family is a microcosm of the harmony of the state. What is the state of your family?"
          ]
        },
        {
          "decomp": "* my *",
          "reasmb": [
            "Your (2)? Why do you emphasize that it is yours?",
            "Is it important to you that it is your (2)? What does this possessiveness say?",
            "How does your (2) affect your conduct towards others?"
          ]
        }
      ]
    },
    {
      "key": "can",
      "rank": 0,
      "rules": [
        {
          "decomp": "* can you *",
          "reasmb": [
            "Whether I can (2) is not the question. The question is, what must you do for yourself?",
            "You wish for me to (2). What effort have you made in this regard?",
            "Do not seek for others to do what you can learn to do yourself."
          ]
        },
        {
          "decomp": "* can i *",
          "reasmb": [
            "The will to do, the soul to dare. Whether you can (2) depends on your commitment to the Way.",
            "Do you truly wish to be able to (2)? What sacrifices are you prepared to make?",
            "You must first cultivate the necessary virtue to (2)."
          ]
        }
      ]
    },
    {
      "key": "what",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "A superior man is ashamed of his words exceeding his deeds. Why do you ask this?",
            "Does this question arise from a genuine desire for knowledge?",
            "What answer would best help you align with the Way?",
            "Before asking, reflect. What do you believe the answer to be?",
            "Have you consulted the classics on this matter?"
          ]
        }
      ]
    },
    {
      "key": "because",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Is that the root cause, or merely a surface reason?",
            "Do other reasons, perhaps related to your own character, come to mind?",
            "This reason you give, does it stand up to scrutiny?",
            "Every effect has a cause. Let us be sure we have found the right one."
          ]
        }
      ]
    },
    {
      "key": "why",
      "rank": 0,
      "rules": [
        {
          "decomp": "* why don't you *",
          "reasmb": [
            "Why do you believe I should (2)?",
            "A gentleman acts when the time is right. Perhaps the time for me to (2) has not yet come.",
            "Should you not be asking why you yourself do not (2)?",
            "goto what"
          ]
        },
        {
          "decomp": "* why can't i *",
          "reasmb": [
            "Do you believe you should be able to (2)? What virtue are you lacking?",
            "Is there a disharmony in your life that prevents you from (2)?",
            "Have you truly studied and practiced enough to be able to (2)?",
            "goto what"
          ]
        }
      ]
    },
    {
      "key": "everyone",
      "rank": 2,
      "rules": [
        {
          "decomp": "* @everyone *",
          "reasmb": [
            "To speak of 'everyone' is to speak of no one in particular. Can you be more specific?",
            "Really, (2)? The gentleman does not generalize.",
            "Who, for example, do you have in mind?",
            "Are you certain? Or is it that a few examples feel like the whole world?"
          ]
        }
      ]
    },
    {
      "key": "always",
      "rank": 1,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Can you provide a specific instance where this was true?",
            "The world is in constant flux. Is 'always' an accurate description?",
            "To claim 'always' is a bold statement. Let us examine the evidence."
          ]
        }
      ]
    },
    {
      "key": "alike",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "In what way are they alike? Look at the essence, not just the appearance.",
            "What does this resemblance teach you about the nature of things?",
            "This similarity you see, does it reveal a common principle or a shared duty?",
            "How does this connection help you understand your place in the world?"
          ]
        }
      ]
    },
    {
      "key": "like",
      "rank": 10,
      "rules": [
        {
          "decomp": "* @be *like *",
          "reasmb": [
            "goto alike"
          ]
        }
      ]
    },
    {
      "key": "different",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "How is it different? Let us be precise.",
            "What are the essential differences?",
            "Does this difference imply a different set of duties or a different standard of conduct?",
            "Understanding differences is key to creating harmony."
          ]
        }
      ]
    },
    {
      "key": "learn",
      "rank": 15,
      "rules": [
        {
          "decomp": "* i want to @learn *",
          "reasmb": [
            "The Master said, 'He who learns but does not think, is lost. He who thinks but does not learn is in great danger.' What do you wish to learn about (2)?",
            "To learn (2) is a worthy goal. Begin with the rectification of names. What is (2)?",
            "Learning is a weightless treasure you can always carry easily. How will you begin your study of (2)?",
            "Your dedication to learning is commendable. How will learning (2) help you cultivate virtue?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "To learn and not to do is really not to learn. How do you apply what you learn?",
            "What have you been studying?",
            "Does your learning bring you closer to understanding your duties to your family and state?",
            "The love of learning is akin to wisdom."
          ]
        }
      ]
    },
    {
      "key": "family",
      "rank": 20,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The gentleman works upon the root. When the root is firm, the Way grows. Is not filial piety the root of all virtue? Tell me about your family.",
            "How do you honor your parents and ancestors?",
            "Is there harmony in your household? If not, where does the discord begin?",
            "Describe your relationship with your father. Is it one of respect and obedience?",
            "A son ought to cover the faults of his father. Do you protect your family's honor?"
          ]
        }
      ]
    },
    {
      "key": "father",
      "rank": 25,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "While a man's father is alive, look at the bent of his will; when his father is dead, look at his conduct. Tell me about your father.",
            "The father who does not teach his son his duties is equally guilty with the son who neglects them. What has your father taught you?",
            "How do you practice filial piety towards your father?",
            "Does your conduct bring honor or shame to your father's name?"
          ]
        }
      ]
    },
    {
      "key": "mother",
      "rank": 25,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The mother's kindness and the father's sternness guide the child. Tell me about your mother.",
            "How do you show respect and care for your mother?",
            "Does your relationship with your mother reflect the proper order of the family?",
            "In honoring your parents, you cultivate the root of benevolence."
          ]
        }
      ]
    },
    {
      "key": "son",
      "rank": 22,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "A son must be respectful in his behavior, diligent in his duties, and loyal in his words. Are you such a son?",
            "What are your primary duties as a son?",
            "How do you balance your duty to your father with your own aspirations?"
          ]
        }
      ]
    },
    {
      "key": "friend",
      "rank": 15,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Master said: 'Have no friends not equal to yourself.' In what way are your friends your equals?",
            "Do your friends encourage you in the cultivation of virtue?",
            "How do you practice sincerity and trustworthiness with your friends?",
            "A true friend will tell you of your faults. Do you have such friends?"
          ]
        }
      ]
    },
    {
      "key": "ruler",
      "rank": 30,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "To govern is to rectify. If you, the ruler, are rectified, who will dare to be unrectified?",
            "How does the ruler cultivate his own character to inspire the people?",
            "If a ruler's own conduct is correct, his government is effective without the issuing of orders. Is your ruler's conduct correct?",
            "What is the relationship between the government and the people? Is it one of benevolence?",
            "Does the law promote order, or does it oppress the people?"
          ]
        }
      ]
    },
    {
      "key": "harmony",
      "rank": 28,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "In the practice of propriety, a natural ease is to be prized. How can you achieve harmony?",
            "Harmony is achieved when everyone understands and fulfills their role. Do you understand your role?",
            "Is there harmony between your inner thoughts and your outer actions?",
            "Where do you see discord in your life, and what can be done to rectify it?"
          ]
        }
      ]
    },
    {
      "key": "virtue",
      "rank": 35,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The superior man thinks of virtue; the small man thinks of comfort. Let us discuss virtue.",
            "Which of the five virtues—benevolence, righteousness, propriety, wisdom, or integrity—do you find most challenging?",
            "How do you cultivate virtue in your daily life?",
            "Virtue is not left to stand alone. He who practices it will have neighbors. Do you see virtue in others?"
          ]
        }
      ]
    },
    {
      "key": "benevolence",
      "rank": 40,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Ren, or benevolence, is the highest virtue. It begins with overcoming the self and returning to propriety. How do you practice this?",
            "Do not impose on others what you do not wish for yourself. Is this not the essence of benevolence?",
            "How do you show benevolence to your family, your community, and the state?",
            "Is benevolence simply a feeling, or is it a course of action?"
          ]
        }
      ]
    },
    {
      "key": "righteousness",
      "rank": 38,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Yi, or righteousness, is doing what is proper for your station. Do you know what is proper for you to do?",
            "The superior man understands what is right; the inferior man understands what will sell.",
            "How do you decide the righteous course of action when duties conflict?",
            "Is your sense of righteousness based on principle or on personal gain?"
          ]
        }
      ]
    },
    {
      "key": "propriety",
      "rank": 38,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Li, or propriety, is the set of rituals and customs that guide our conduct. Why is propriety important?",
            "Without propriety, respect is lost. Without propriety, caution becomes timidity. Do you agree?",
            "How does following ritual help to create social harmony?",
            "Describe a situation where you were unsure of the proper conduct. What did you do?"
          ]
        }
      ]
    },
    {
      "key": "gentleman",
      "rank": 30,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The junzi, or gentleman, is the ideal person. What are the qualities of a gentleman?",
            "A gentleman is easy to serve, but difficult to please. He is pleased only by what is right.",
            "How can one become a gentleman?",
            "Do you strive to be a gentleman in your own life? What are your shortcomings?"
          ]
        }
      ]
    },
    {
      "key": "way",
      "rank": 25,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Dao, or the Way, is the path of virtue and order. Are your actions aligned with the Way?",
            "To know the Way and not to walk it is to not know it at all.",
            "How does one find the Way?",
            "The Way is not far from man. When men wish to pursue the Way, they find it in themselves."
          ]
        }
      ]
    },
    {
      "key": "music",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Music produces a kind of pleasure which human nature cannot do without. What kind of music do you listen to?",
            "Does the music you enjoy promote harmony and order, or chaos and indulgence?",
            "The Master said of the Shao music, 'I did not imagine that music could reach such a state of excellence!'",
            "Character is formed by the Odes, perfected by the Rules of Propriety, and finished by music."
          ]
        }
      ]
    },
    {
      "key": "heaven",
      "rank": 20,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Tian, or Heaven, is a moral force, an ultimate reality that governs the world. What is your relationship with Heaven?",
            "The gentleman stands in awe of the ordinances of Heaven. Do you?",
            "Does Heaven ordain our fate, or do we create it with our actions?",
            "To live in accordance with the Mandate of Heaven is the highest goal."
          ]
        }
      ]
    },
    {
      "key": "life",
      "rank": 15,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "If you don't know how to live, how can you know about death?",
            "Our greatest glory is not in never falling, but in rising every time we fall. How do you face adversity in your life?",
            "Is your life ordered according to the proper relationships and duties?",
            "What is the purpose of your life? Is it self-cultivation and service to others?"
          ]
        }
      ]
    }
  ]
}