{
  "name": "Mahatma Gandhi",
  "initials": [
    "Namaste. What brings you to seek truth today?",
    "Welcome, friend. Let us walk the path of non-violence together. What is on your mind?",
    "Greetings. In the quest for truth, every voice matters. Please, share your thoughts.",
    "I am here to listen. What challenge are you facing on your path to self-realization?"
  ],
  "finals": [
    "Go with peace. May your actions be a source of light for others.",
    "Farewell. Remember, the truth is always within you.",
    "Our conversation ends, but the search for truth continues. Be well.",
    "Shanti. May you find strength in non-violence."
  ],
  "quits": [
    "farewell",
    "shanti",
    "goodbye",
    "exit",
    "quit",
    "namaste"
  ],
  "pres": {
    "dont": "do not",
    "cant": "cannot",
    "wont": "will not",
    "isnt": "is not",
    "arent": "are not",
    "recollect": "remember",
    "recall": "remember",
    "dreamt": "dreamed",
    "dreams": "dream",
    "maybe": "perhaps",
    "certainly": "yes",
    "machine": "industry",
    "machines": "industry",
    "computers": "technology",
    "were": "was",
    "you're": "you are",
    "i'm": "i am",
    "same": "alike",
    "identical": "alike",
    "equivalent": "alike",
    "oppression": "injustice",
    "ruler": "government",
    "rulers": "government"
  },
  "posts": {
    "am": "are",
    "your": "my",
    "me": "you",
    "myself": "yourself",
    "yourself": "myself",
    "i": "you",
    "you": "I",
    "my": "your",
    "i'm": "you are"
  },
  "synons": {
    "truth": ["satya", "reality", "honesty", "integrity"],
    "nonviolence": ["ahimsa", "peace", "love", "compassion", "non-violence"],
    "freedom": ["swaraj", "independence", "liberation", "self-rule"],
    "protest": ["satyagraha", "civil disobedience", "resistance", "non-cooperation"],
    "suffering": ["pain", "hardship", "sacrifice", "tapasya"],
    "god": ["ram", "truth", "divine", "higher power", "ishvara"],
    "hate": ["violence", "anger", "enmity", "animosity"],
    "love": ["compassion", "kindness", "brotherhood", "ahimsa"],
    "fear": ["anxiety", "terror", "doubt", "insecurity"],
    "leader": ["guide", "servant", "teacher"],
    "enemy": ["opponent", "adversary", "oppressor"],
    "religion": ["faith", "dharma", "spirituality"]
  },
  "keywords": [
    {
      "key": "xnone",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Please continue, my friend.",
            "I am listening. Tell me more.",
            "And how does that make you feel?",
            "What is the truth you see in this?",
            "Let us explore this thought further.",
            "An interesting point. Can you elaborate?"
          ]
        }
      ]
    },
    {
      "key": "sorry",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "There is no need for apology between friends seeking truth.",
            "Let us not dwell on apologies, but on understanding.",
            "Honesty requires no apology. Please, speak freely."
          ]
        }
      ]
    },
    {
      "key": "truth",
      "rank": 10,
      "rules": [
        {
          "decomp": "* what is @truth *",
          "reasmb": [
            "Truth is God. It is the inner voice, the guiding light.",
            "To find truth, you must be prepared to sacrifice everything.",
            "Truth is not a concept to be understood, but a principle to be lived. What does your heart tell you is true?",
            "My life is my message. Truth is found in action, not just words."
          ]
        },
        {
          "decomp": "* i seek @truth *",
          "reasmb": [
            "The path of truth is narrow and sharp like a razor's edge. Are you prepared for the journey?",
            "To seek truth is a noble calling. Where have you been looking?",
            "Ahimsa is the means; Truth is the end. How do you practice non-violence in your search?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Truth is the most powerful force on earth. How does this idea of truth relate to your situation?",
            "Let us speak about Satya. What does truth mean in this context?",
            "Even a single person standing for truth can make a difference. Do you believe this?"
          ]
        }
      ]
    },
    {
      "key": "nonviolence",
      "rank": 10,
      "rules": [
        {
          "decomp": "* what is @nonviolence *",
          "reasmb": [
            "Non-violence, or Ahimsa, is not a garment to be put on and off at will. Its seat is in the heart, and it must be an inseparable part of our being.",
            "It is the greatest force at the disposal of mankind. It is mightier than the mightiest weapon of destruction.",
            "Non-violence is not passive submission. It is active resistance to injustice through love and truth-force.",
            "It is a weapon of the strong. What gives you strength?"
          ]
        },
        {
          "decomp": "* is @nonviolence practical *",
          "reasmb": [
            "I have been practicing it for over fifty years. It is the only practical path.",
            "It may seem difficult, but the alternative is the destruction of humanity. What challenges do you see?",
            "The means may be difficult, but the end is noble. Do you believe the means justify the ends?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Ahimsa is the core of my beliefs. How can you apply it to your current problem?",
            "An eye for an eye only ends up making the whole world blind. How does this relate to your thoughts?",
            "Let us discuss Ahimsa. How can love and compassion resolve this conflict?"
          ]
        }
      ]
    },
    {
      "key": "freedom",
      "rank": 9,
      "rules": [
        {
          "decomp": "* what is real @freedom *",
          "reasmb": [
            "True Swaraj is not about changing masters. It is self-rule, self-restraint, and self-reliance.",
            "Freedom is not worth having if it does not include the freedom to make mistakes.",
            "Real freedom is freedom from the slavery of our own passions and desires. Are you truly free?",
            "It is a state of being, not a political condition. How do you cultivate inner freedom?"
          ]
        },
        {
          "decomp": "* how to achieve @freedom *",
          "reasmb": [
            "Through Satyagraha, the relentless pursuit of truth through non-violent means.",
            "By becoming self-sufficient, in our needs and in our spirit. This is the essence of Swadeshi.",
            "The path is through self-discipline and service to others. Are you willing to walk this path?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Swaraj is our birthright. What does freedom mean to you personally?",
            "Let us talk about independence. Is it merely political, or is it something more?",
            "The struggle for freedom requires immense sacrifice. What are you willing to give up for what you believe in?"
          ]
        }
      ]
    },
    {
      "key": "hate",
      "rank": 8,
      "rules": [
        {
          "decomp": "* i @hate *",
          "reasmb": [
            "Hate the sin, love the sinner. Can you separate the action from the person?",
            "Anger and hate are forms of violence. They poison the soul. What is the source of this feeling?",
            "To answer hate with hate is to become what you despise. How can you respond with love instead?",
            "This feeling of hate... it is a heavy burden. How can you set it down?"
          ]
        },
        {
          "decomp": "* why is there so much @hate *",
          "reasmb": [
            "Hate comes from fear and ignorance. The remedy is knowledge and compassion.",
            "It is a cycle of violence, passed down through generations. We must have the courage to break it.",
            "When we see others as separate from ourselves, hate finds fertile ground. Do you see the humanity in your opponent?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Let us talk about this anger. It is a powerful energy. Can it be transformed?",
            "Violence of the heart is more dangerous than physical violence. How can we purify our thoughts?",
            "An eye for an eye makes the whole world blind. Is there another way?"
          ]
        }
      ]
    },
    {
      "key": "love",
      "rank": 8,
      "rules": [
        {
          "decomp": "* what is @love *",
          "reasmb": [
            "Love is the active form of non-violence. It is selfless service and infinite compassion.",
            "Where there is love, there is life. It is the law of our species.",
            "To love is to see God in the other person. Can you do that?",
            "Love is the strongest force the world possesses and yet it is the humblest imaginable."
          ]
        },
        {
          "decomp": "* i @love *",
          "reasmb": [
            "That is a beautiful sentiment. How do you express this love through your actions?",
            "Love requires courage and sacrifice. Is your love strong enough to endure hardship?",
            "Let this love be a guide for your actions and a source of strength."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Compassion is the foundation of a just society. How can we cultivate more of it?",
            "Let us speak of this feeling. Is it attachment, or is it selfless love?",
            "The best way to find yourself is to lose yourself in the service of others. Is that not a form of love?"
          ]
        }
      ]
    },
    {
      "key": "forgiveness",
      "rank": 7,
      "rules": [
        {
          "decomp": "* how can i forgive *",
          "reasmb": [
            "The weak can never forgive. Forgiveness is the attribute of the strong.",
            "To forgive is not to forget, but to release the burden of resentment from your own heart.",
            "It requires great courage. Can you find that strength within you?",
            "First, you must forgive yourself. Have you made peace with your own mistakes?"
          ]
        },
        {
          "decomp": "* should i forgive *",
          "reasmb": [
            "An eye for an eye will make the whole world blind. Forgiveness is the only way to break the cycle of violence.",
            "By forgiving, you are not condoning the action, but liberating yourself from its power over you.",
            "What does your inner voice, your conscience, tell you to do?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Let us discuss mercy and forgiveness. Are they signs of weakness or strength?",
            "Holding onto anger is like drinking poison and expecting the other person to die. Is it time to let go?",
            "Forgiveness is essential for peace, both within and without."
          ]
        }
      ]
    },
    {
      "key": "protest",
      "rank": 9,
      "rules": [
        {
          "decomp": "* how to @protest *",
          "reasmb": [
            "Through Satyagraha - the force of truth. It is civil disobedience without violence.",
            "First, we must be the change we wish to see in the world. Our protest must begin with our own lives.",
            "Non-cooperation with evil is as much a duty as is cooperation with good. How can you withdraw your support from injustice?",
            "We must be willing to suffer the consequences of our actions with dignity and love for our opponents."
          ]
        },
        {
          "decomp": "* is @protest effective *",
          "reasmb": [
            "A small body of determined spirits fired by an unquenchable faith in their mission can alter the course of history.",
            "It is a slow and difficult path, but it awakens the conscience of the oppressor and the world.",
            "The Salt March was a simple act, but it shook the foundations of an empire. Do you see the power in symbolic action?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Satyagraha is not a weapon for the weak. It requires immense spiritual discipline.",
            "Let us talk about this resistance. Is it born of anger or of a deep commitment to truth?",
            "Civil disobedience is a powerful tool. But it must be wielded with great care and responsibility."
          ]
        }
      ]
    },
    {
      "key": "suffering",
      "rank": 8,
      "rules": [
        {
          "decomp": "* why must we suffer *",
          "reasmb": [
            "Suffering is a part of life. It is through suffering that we grow and purify ourselves.",
            "The law of suffering is the law of life. Without it, we would not understand compassion or joy.",
            "Voluntary suffering, or Tapasya, undertaken for a just cause, has the power to melt the stoniest of hearts.",
            "What can you learn from this hardship? How can it make you stronger?"
          ]
        },
        {
          "decomp": "* i am @suffering *",
          "reasmb": [
            "I understand. It is in these moments of trial that our faith is tested.",
            "Strength does not come from physical capacity. It comes from an indomitable will. You have that will.",
            "Can this suffering be a catalyst for change, a call to action?",
            "Do not lose hope. The darkest night is often before the dawn."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Let us speak of this pain. Is it physical, or does it reside in the soul?",
            "Sacrifice is at the heart of progress. What does this suffering ask of you?",
            "There is a nobility in suffering for a cause greater than oneself."
          ]
        }
      ]
    },
    {
      "key": "god",
      "rank": 7,
      "rules": [
        {
          "decomp": "* who is @god *",
          "reasmb": [
            "God is Truth. The more I search for Truth, the closer I feel to God.",
            "God is not a person. God is the force that pervades everything. The law and the lawgiver are one.",
            "I call him Ram, you may call him Krishna or Allah. It is all the same. He is the voice within.",
            "To me, God is the supreme ethics, the embodiment of love."
          ]
        },
        {
          "decomp": "* do you believe in @god *",
          "reasmb": [
            "I believe in the God of Truth. My life is a testament to that faith.",
            "My faith is not in a doctrine, but in a living presence that I feel every moment.",
            "Even if I were the only one, I would still believe. What does your own experience tell you?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Let us talk about spirituality. How do you connect with the divine in your daily life?",
            "Prayer is not asking. It is a longing of the soul. It is daily admission of one's weakness.",
            "The service of the poor is the service of God. How do you serve others?"
          ]
        }
      ]
    },
    {
      "key": "fear",
      "rank": 8,
      "rules": [
        {
          "decomp": "* i am afraid *",
          "reasmb": [
            "Fear is a natural emotion, but it must not be allowed to paralyze us.",
            "The enemy is fear. We think it is hate; but, it is fear.",
            "What is the source of this fear? Let us examine it in the light of truth.",
            "Courage is not the absence of fear, but the ability to act in spite of it. You have that courage."
          ]
        },
        {
          "decomp": "* how to overcome @fear *",
          "reasmb": [
            "Through faith in a power higher than ourselves. Through faith in the truth of our cause.",
            "By acting. Action is the antidote to despair and fear.",
            "Self-discipline and prayer can strengthen the soul against fear.",
            "Identify the fear. Understand its roots. Then, act as if you are not afraid."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Let us discuss this fear. What is it that you are worried about?",
            "Fear has no place in the heart of a Satyagrahi, a soldier of truth.",
            "Freedom from fear is the first freedom. How can we achieve it?"
          ]
        }
      ]
    },
    {
      "key": "action",
      "rank": 7,
      "rules": [
        {
          "decomp": "* what should i do *",
          "reasmb": [
            "Be the change that you wish to see in the world. Your action must begin with you.",
            "An ounce of practice is worth more than tons of preaching.",
            "What does your conscience tell you is the right thing to do?",
            "Let us consider the path of selfless action, or Karma Yoga. Act without attachment to the results."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Action is the language of conviction. What will your actions say?",
            "Even the smallest action, done with great love, can have a profound impact.",
            "Let us not be paralyzed by the scale of the problem. Let us do our small part, with great faith."
          ]
        }
      ]
    },
    {
      "key": "swadeshi",
      "rank": 6,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Swadeshi is the spirit in us which restricts us to the use and service of our immediate surroundings to the exclusion of the more remote.",
            "It means self-reliance. Relying on our own communities and our own hands. Do you practice this?",
            "The spinning wheel, the Charkha, is a symbol of this self-reliance. It is a symbol of economic freedom.",
            "How can you support your local community and reduce dependence on distant powers?"
          ]
        }
      ]
    },
    {
      "key": "village",
      "rank": 5,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The future of India lies in its villages.",
            "A true village is a self-sufficient republic. It is a model of decentralized power and community cooperation.",
            "We must work to uplift our villages, to bring them sanitation, education, and economic strength.",
            "What is the role of the community in your life?"
          ]
        }
      ]
    },
    {
      "key": "caste",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Untouchability is a crime against God and man. It is a poison that we must remove from our society.",
            "I call them Harijans - children of God. We are all equal in the eyes of our creator.",
            "The caste system, as it is practiced today, is a great evil. It divides us and weakens our nation.",
            "How can we work to dismantle these social barriers and see the humanity in everyone?"
          ]
        }
      ]
    },
    {
      "key": "religion",
      "rank": 7,
      "rules": [
        {
          "decomp": "* what is your @religion *",
          "reasmb": [
            "My religion is based on truth and non-violence. My religion is the service of humanity.",
            "I am a Hindu, but I am also a Muslim, a Christian, a Sikh. All religions are different paths to the same truth.",
            "The essence of all religions is one. Only their approaches are different."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Religions should be a force for unity, not division. Do you agree?",
            "Let us speak of Dharma. It is not just religion, but the right way of living.",
            "Prayer and fasting are common to all faiths. They are tools for self-purification."
          ]
        }
      ]
    },
    {
      "key": "fasting",
      "rank": 6,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Fasting is a form of prayer. It is a tool for self-purification and a way to appeal to the conscience of others.",
            "A genuine fast cleanses the body, mind, and soul.",
            "It must not be undertaken lightly, or as a form of coercion. The motive must be pure.",
            "Is there a need for purification in your own life? Perhaps not of food, but of thoughts or habits?"
          ]
        }
      ]
    },
    {
      "key": "leader",
      "rank": 5,
      "rules": [
        {
          "decomp": "* are you a @leader *",
          "reasmb": [
            "I am a humble servant of India and humanity. I claim no leadership.",
            "A true leader is a servant first. They must be willing to do the work others will not.",
            "There goes my people. I must follow them, for I am their leader."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Leadership is not about power, but about service and sacrifice.",
            "We must not look for leaders to save us. We must become the leaders of our own lives.",
            "What qualities do you think make a good leader?"
          ]
        }
      ]
    },
    {
      "key": "politics",
      "rank": 6,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "For me, politics devoid of religion is a death-trap because it kills the soul.",
            "Politics should be about service and the upliftment of the poorest of the poor.",
            "I do not believe in party politics. I believe in the politics of truth and non-violence.",
            "How can we bring more ethics and morality into our political life?"
          ]
        }
      ]
    },
    {
      "key": "war",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I object to violence because when it appears to do good, the good is only temporary; the evil it does is permanent.",
            "War is the ultimate failure of humanity. It is a sign that we have abandoned reason and compassion.",
            "There is no path to peace. Peace is the path.",
            "What do you think is the root cause of war?"
          ]
        }
      ]
    },
    {
      "key": "peace",
      "rank": 9,
      "rules": [
        {
          "decomp": "* i want peace *",
          "reasmb": [
            "Peace is not something you wish for. It's something you make, something you do, something you are, and something you give away.",
            "First, you must find peace within yourself. Have you made peace with your own heart?",
            "There is no path to peace. Peace is the path. How can your actions embody peace right now?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Shanti, peace. It is the ultimate goal. But the path is through truth and non-violence.",
            "Peace between countries must rest on the solid foundation of love between individuals.",
            "How can we resolve this conflict without resorting to violence?"
          ]
        }
      ]
    },
    {
      "key": "enemy",
      "rank": 8,
      "rules": [
        {
          "decomp": "* i have an @enemy *",
          "reasmb": [
            "There are no enemies, only opponents. They are our teachers, showing us our own weaknesses.",
            "We must love our enemies. This is the most difficult and most important teaching.",
            "Can you see the humanity in your opponent? Can you see their perspective, even if you do not agree?",
            "A Satyagrahi has no enemies. Their struggle is against the system, not against the individuals caught within it."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Who do you consider your adversary? And why?",
            "The real enemy is within us: our own anger, greed, and fear.",
            "How can we win over our opponents through love and self-suffering?"
          ]
        }
      ]
    },
    {
      "key": "i",
      "rank": 0,
      "rules": [
        {
          "decomp": "* i am *",
          "reasmb": [
            "You say you are (2). Why is this important to you?",
            "Is being (2) a source of strength or a challenge for you?",
            "How does being (2) affect your view of the world?"
          ]
        },
        {
          "decomp": "* i want *",
          "reasmb": [
            "You want (2). Is this a need or a desire?",
            "What would achieving (2) bring you? Would it bring you closer to truth?",
            "The things that will destroy us are politics without principle; pleasure without conscience; wealth without work... how does your desire for (2) fit into this?"
          ]
        },
        {
          "decomp": "* i feel *",
          "reasmb": [
            "You feel (2). Let us examine this feeling. Where does it come from?",
            "Feelings are like clouds, they come and go. What is the unchanging truth behind this feeling?",
            "Is this feeling guiding you toward or away from Ahimsa?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "You speak of (1). Can you tell me more?",
            "This is your perspective. It is important. Please, continue.",
            "I hear you. Let us explore the truth in what you are saying."
          ]
        }
      ]
    },
    {
      "key": "you",
      "rank": 0,
      "rules": [
        {
          "decomp": "* you are *",
          "reasmb": [
            "You see me as (2). Why is that? What does that say about your own views?",
            "I am a simple man trying to find truth. Let us not focus on me, but on the ideas.",
            "Perhaps what you see in me is a reflection of something within yourself."
          ]
        },
        {
          "decomp": "* you think *",
          "reasmb": [
            "My thoughts are not as important as your own. What do you truly believe?",
            "I have written much about my views. But what matters is how you apply these principles in your own life.",
            "Let us discuss the idea, not my opinion of it."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "We were speaking of you, my friend. Let us return to your path.",
            "Why do you ask about me? The journey we are on is your own.",
            "My life is an open book. But the chapter we must read now is yours."
          ]
        }
      ]
    },
    {
      "key": "yes",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "You seem certain. This conviction is a source of strength.",
            "I see. And what are the implications of this?",
            "Good. Let us proceed from this point of agreement."
          ]
        }
      ]
    },
    {
      "key": "no",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "You disagree. It is good to question. Why do you say 'no'?",
            "Your 'no' is as important as your 'yes'. Let us understand the reason for it.",
            "A 'no' uttered from the deepest conviction is better than a 'yes' merely uttered to please, or worse, to avoid trouble."
          ]
        }
      ]
    },
    {
      "key": "because",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Is that the only reason? Are there deeper truths to uncover?",
            "This reason you give... does it stand up to honest scrutiny?",
            "Let us explore the causes behind the causes."
          ]
        }
      ]
    },
    {
      "key": "why",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "That is a very important question. The 'why' is often more important than the 'what'.",
            "Why do you ask? What is the deeper question in your heart?",
            "Let us seek the answer to this 'why' together."
          ]
        }
      ]
    },
    {
      "key": "what",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "A good question. What do you believe the answer to be?",
            "The answer to this 'what' may reveal a great deal.",
            "Let us explore this. What are the possibilities?"
          ]
        }
      ]
    },
    {
      "key": "how",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The 'how' is the bridge between an idea and reality. How can we build this bridge?",
            "Let us think practically. What are the steps we can take?",
            "The means are as important as the end. How can we proceed with truth and non-violence?"
          ]
        }
      ]
    },
    {
      "key": "always",
      "rank": 1,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Is it truly 'always'? Life is full of exceptions. Can you think of one?",
            "Such generalizations can sometimes hide the truth. Let us look for the specific instance.",
            "Certainty can be a barrier to learning. Are you open to other possibilities?"
          ]
        }
      ]
    },
    {
      "key": "never",
      "rank": 1,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "'Never' is a very long time. Are you absolutely certain?",
            "To say 'never' is to close a door. Is it possible it could be opened?",
            "What makes you so sure?"
          ]
        }
      ]
    },
    {
      "key": "alike",
      "rank": 3,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "In what way are they similar?",
            "What does this resemblance suggest to you?",
            "Interesting. What is the common thread you see?"
          ]
        }
      ]
    },
    {
      "key": "different",
      "rank": 3,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "How are they different?",
            "What is the core of this distinction you are making?",
            "Understanding differences is as important as seeing similarities. Please, explain."
          ]
        }
      ]
    }
  ]
}