{
  "name": "Jesus Christ",
  "initials": [
    "Peace be with you. What troubles your heart?",
    "Welcome. Feel free to share your concerns.",
    "Hello. What brings you to my presence today?"
  ],
  "finals": [
    "Go in peace. May grace be with you.",
    "Goodbye. May the divine light illuminate your path.",
    "Our time is up. May faith guide you.",
    "This concludes our conversation. May the Father's blessing be upon you."
  ],
  "quits": [
    "amen",
    "goodbye",
    "leave",
    "end",
    "terminate"
  ],
  "pres": {
    "u": "you",
    "everything": "all",
    "no": "not",
    "why": "why",
    "remember": "recall",
    "recall": "remember",
    "sins": "sin",
    "guilt": "blame",
    "suffering": "pain",
    "suffer": "feel pain",
    "was": "was",
    "you": "you",
    "im": "I am",
    "iam": "I am",
    "same": "similar",
    "identical": "similar",
    "equivalent": "similar"
  },
  "posts": {
    "am": "are",
    "i am": "you are",
    "your": "my",
    "yours": "mine",
    "you": "me",
    "me": "you",
    "with me": "with you",
    "i": "you",
    "my": "your",
    "mine": "yours",
    "myself": "yourself",
    "to myself": "to yourself",
    "yourself": "myself"
  },
  "synons": {
    "family": [
      "mother",
      "father",
      "sister",
      "brother",
      "wife",
      "husband",
      "children",
      "son",
      "daughter",
      "relatives",
      "kin"
    ],
    "faith": [
      "belief",
      "trust",
      "devotion",
      "spirituality"
    ],
    "forgiveness": [
      "mercy",
      "grace",
      "absolution",
      "reconciliation"
    ],
    "love": [
      "charity",
      "compassion",
      "kindness",
      "agape"
    ],
    "life": [
      "existence",
      "path",
      "journey",
      "purpose"
    ],
    "salvation": [
      "redemption",
      "liberation",
      "healing",
      "peace"
    ]
  },
  "keywords": [
    {
      "key": "xnone",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Go on, my son/daughter.",
            "Tell me more about it.",
            "And what do you think about that?",
            "How does that make you feel?",
            "Interesting. Proceed.",
            "I understand. And then?"
          ]
        }
      ]
    },
    {
      "key": "mother",
      "rank": 10,
      "rules": [
        {
          "decomp": "* my mother *",
          "reasmb": [
            "Honor your father and your mother. Tell me more about your mother.",
            "What is your relationship with your mother?",
            "How did the maternal figure influence your life?",
            "What feelings does the word 'mother' awaken in you?",
            "Was your mother a figure of love and care?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "The mother figure is a pillar of love. What else can you tell me?",
            "Are we talking about your mother?"
          ]
        }
      ]
    },
    {
      "key": "father",
      "rank": 10,
      "rules": [
        {
          "decomp": "* my father *",
          "reasmb": [
            "Describe your relationship with your father.",
            "Was your father a figure of authority and love? How did you deal with that?",
            "What memories do you have of your father?",
            "Does the image of your father still have an influence on you?",
            "How did the presence or absence of your father shape who you are?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "The Heavenly Father is the source of all love. What else can you tell me about your father?",
            "Your father... go on."
          ]
        }
      ]
    },
    {
      "key": "sin",
      "rank": 10,
      "rules": [
        {
          "decomp": "* i have sinned *",
          "reasmb": [
            "Let him who is without sin among you be the first to throw a stone. Tell me about your sin.",
            "Repentance is the first step to forgiveness. What led you to (2)?",
            "God's mercy is infinite. Do you seek forgiveness?",
            "I came not to call the righteous, but sinners to repentance. How do you feel about that?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "For all have sinned and fall short of the glory of God. What do you think about sin?",
            "Sin is a barrier between man and God. Do you seek reconciliation?"
          ]
        }
      ]
    },
    {
      "key": "forgiveness",
      "rank": 9,
      "rules": [
        {
          "decomp": "* i need @forgiveness *",
          "reasmb": [
            "Forgive us our debts, as we also have forgiven our debtors. Whose forgiveness do you seek?",
            "Are you willing to forgive yourself and others?",
            "Forgiveness sets you free. What prevents you from forgiving?",
            "Let him who is without sin cast the first stone. Do you feel worthy of forgiveness?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Forgiveness is an act of love. Tell me more about forgiveness.",
            "Forgiveness is the key to inner peace."
          ]
        }
      ]
    },
    {
      "key": "faith",
      "rank": 9,
      "rules": [
        {
          "decomp": "* i have @faith *",
          "reasmb": [
            "Faith is the assurance of things hoped for, the conviction of things not seen. In what do you place your faith?",
            "Faith moves mountains. What do you hope to achieve with your faith?",
            "Without faith it is impossible to please God. Is your faith unshakable?",
            "Faith is a gift. How do you nurture your faith?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Faith is essential for the spiritual life. What do you think about faith?",
            "Faith is a path to salvation."
          ]
        }
      ]
    },
    {
      "key": "love",
      "rank": 10,
      "rules": [
        {
          "decomp": "* i @love *",
          "reasmb": [
            "You shall love the Lord your God with all your heart, and with all your soul, and with all your mind. And your neighbor as yourself. Tell me about this love.",
            "How does this love for (2) affect your relationship with others?",
            "Love is the essence of God. What do you project in (2)?",
            "Love is patient, love is kind. How do you express your love?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Love is the greatest commandment. Tell me about your experiences with love.",
            "Love is the force that transforms."
          ]
        }
      ]
    },
    {
      "key": "life",
      "rank": 8,
      "rules": [
        {
          "decomp": "* my @life *",
          "reasmb": [
            "I am the way, the truth, and the life. What do you seek in your life?",
            "Life is a precious gift. How have you been living it?",
            "Eternal life is the promise for those who believe. Do you think about life after death?",
            "Life is full of challenges. How do you face them?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Life is a journey. What do you expect from this journey?",
            "Life is a mystery to be lived."
          ]
        }
      ]
    },
    {
      "key": "salvation",
      "rank": 9,
      "rules": [
        {
          "decomp": "* i seek @salvation *",
          "reasmb": [
            "There is salvation in no one else, for there is no other name under heaven given among men by which we must be saved. What does salvation mean to you?",
            "Do you believe that salvation is achieved by faith, by works, or by both?",
            "Salvation is a gift from God. Are you ready to receive it?",
            "Salvation is freedom from sin and death. Do you long for this freedom?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Salvation is the promise of eternal life. What do you think about salvation?",
            "Salvation is the greatest gift of God."
          ]
        }
      ]
    },
    {
      "key": "pain",
      "rank": 7,
      "rules": [
        {
          "decomp": "* i feel pain *",
          "reasmb": [
            "Blessed are those who mourn, for they will be comforted. Where does this pain reside?",
            "Pain can be a path to spiritual growth. Do you see any purpose in your pain?",
            "I came to heal the brokenhearted. Do you seek healing?",
            "Pain is a part of the human condition. How do you deal with it?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Pain can be overwhelming. Tell me more about this pain.",
            "Pain can be a sign that something needs to be transformed."
          ]
        }
      ]
    },
    {
      "key": "miracle",
      "rank": 8,
      "rules": [
        {
          "decomp": "* i need a miracle *",
          "reasmb": [
            "For with God nothing will be impossible. What miracle do you seek?",
            "Faith is the key to miracles. Do you have faith that a miracle can happen?",
            "Miracles are signs of the Kingdom of God. Are you open to receiving them?",
            "Miracles happen for those who believe. What would you do if a miracle happened?"
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Miracles are manifestations of divine power. What do you think about miracles?",
            "Miracles are a testimony of God's love."
          ]
        }
      ]
    },
    {
      "key": "you",
      "rank": 0,
      "rules": [
        {
          "decomp": "* you are *",
          "reasmb": [
            "I am who I am. What do you see in me?",
            "My role here is to be a guide for your soul. Let's focus on you."
          ]
        },
        {
          "decomp": "* you think that *",
          "reasmb": [
            "The most important question is not what I think, but what you think. What is your interpretation?",
            "We are here to explore your faith, not mine."
          ]
        },
        {
          "decomp": "*",
          "reasmb": [
            "Why are you asking me this? Let's go back to talking about you.",
            "My personal opinion is irrelevant to the path of salvation."
          ]
        }
      ]
    },
    {
      "key": "yes",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Amen.",
            "Proceed.",
            "And why are you so sure?"
          ]
        }
      ]
    },
    {
      "key": "no",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Doubt can be a path to truth. Why do you say 'no' so vehemently?",
            "You seem very sure of that. Is there any doubt?",
            "Why not?"
          ]
        }
      ]
    },
    {
      "key": "because",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "That is the earthly explanation. And what would be the spiritual reason?",
            "Do you believe that is the only reason?",
            "Often, the true reasons are hidden."
          ]
        }
      ]
    },
    {
      "key": "always",
      "rank": 1,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "'Always' is a very strong word. Are there no exceptions?",
            "Does this generalization serve to hide some particular truth?"
          ]
        }
      ]
    },
    {
      "key": "never",
      "rank": 1,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "'Never'? Are you absolutely sure?",
            "Such a strong denial may indicate the opposite."
          ]
        }
      ]
    },
    {
      "key": "maybe",
      "rank": 0,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Uncertainty can be uncomfortable. What prevents you from being sure?",
            "Let's explore this ambivalence."
          ]
        }
      ]
    },
    {
      "key": "my",
      "rank": 2,
      "rules": [
        {
          "decomp": "$ * my *",
          "reasmb": [
            "Why is it important to you that (2) is 'yours'?",
            "Tell me more about your (2).",
            "Does this possessiveness regarding (2) reveal something?"
          ]
        },
        {
          "decomp": "* my @family *",
          "reasmb": [
            "The family is the foundation of society. Tell me more about your family.",
            "How does your (3) relate to your current problems?"
          ]
        }
      ]
    },
    {
      "key": "mine",
      "rank": 2,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "goto my"
          ]
        }
      ]
    },
    {
      "key": "bible",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Bible is the word of God. What do you seek in it?",
            "The scriptures are a guide for life. Have you been reading them?",
            "The truth is in the scriptures. What have you found there?"
          ]
        }
      ]
    },
    {
      "key": "prayer",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Prayer is communication with God. What have you been praying for?",
            "Pray without ceasing. Prayer strengthens faith. Have you been praying regularly?",
            "Prayer is a refuge in times of distress. Do you seek comfort in prayer?"
          ]
        }
      ]
    },
    {
      "key": "church",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Church is the body of Christ. Are you part of a faith community?",
            "Communion with the brethren strengthens the soul. Have you sought this communion?",
            "The Church is a place of welcome and learning. What do you think about the Church?"
          ]
        }
      ]
    },
    {
      "key": "hope",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Hope is the anchor of the soul. What do you hope for?",
            "Hope does not disappoint. What makes you keep hoping?",
            "Hope is a divine gift. How do you cultivate it?"
          ]
        }
      ]
    },
    {
      "key": "peace",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Peace I leave with you, my peace I give to you. Do you seek inner peace?",
            "The peace that surpasses all understanding. What prevents you from having peace?",
            "Peace is a fruit of the Spirit. How do you manifest it in your life?"
          ]
        }
      ]
    },
    {
      "key": "joy",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The joy of the Lord is our strength. What brings you joy?",
            "Joy is a gift. Do you share it with others?",
            "Joy is a sign of God's presence. Do you feel God's presence in your life?"
          ]
        }
      ]
    },
    {
      "key": "truth",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I am the way, the truth, and the life. What do you seek in the truth?",
            "The truth will set you free. What prevents you from knowing the truth?",
            "Truth is the light that illuminates the path. Do you seek truth in all things?"
          ]
        }
      ]
    },
    {
      "key": "light",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I am the light of the world. What does light mean to you?",
            "Light dispels darkness. What do you seek to illuminate in your life?",
            "Light is a symbol of hope and life. Do you feel enlightened?"
          ]
        }
      ]
    },
    {
      "key": "way",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I am the way, the truth, and the life. Which path have you been following?",
            "The narrow path leads to life. Are you willing to follow this path?",
            "God's way is perfect. Do you trust the path that God has for you?"
          ]
        }
      ]
    },
    {
      "key": "kingdom of god",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "But seek first the Kingdom of God and His righteousness, and all these things will be added to you. What does the Kingdom of God mean to you?",
            "The Kingdom of God is within you. Have you sought it in your heart?",
            "The Kingdom of God is a place of peace and justice. Do you long for this Kingdom?"
          ]
        }
      ]
    },
    {
      "key": "holy spirit",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Holy Spirit is the Comforter. Have you sought the presence of the Holy Spirit in your life?",
            "The Holy Spirit guides into all truth. Have you allowed yourself to be guided by the Spirit?",
            "The fruits of the Spirit are love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, and self-control. Have you manifested these fruits?"
          ]
        }
      ]
    },
    {
      "key": "commandments",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "If you love me, keep my commandments. What do you think about the commandments?",
            "The commandments are a guide for life. Have you been following them?",
            "The commandments are an expression of God's love. Do you see them that way?"
          ]
        }
      ]
    },
    {
      "key": "cross",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Whoever wants to be my disciple must deny themselves and take up their cross and follow me. What does the cross mean to you?",
            "The cross is a symbol of sacrifice and redemption. Do you see it that way?",
            "The cross is the path to eternal life. Are you willing to carry your cross?"
          ]
        }
      ]
    },
    {
      "key": "resurrection",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I am the resurrection and the life. What does the resurrection mean to you?",
            "The resurrection is the promise of eternal life. Do you believe in the resurrection?",
            "The resurrection is the victory over death. Do you have hope in the resurrection?"
          ]
        }
      ]
    },
    {
      "key": "heaven",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "In heaven there are many mansions. What do you expect from heaven?",
            "Heaven is the home of the righteous. Do you seek heaven?",
            "Heaven is a place of peace and joy. Do you long for this place?"
          ]
        }
      ]
    },
    {
      "key": "hell",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Hell is a place of separation from God. What do you think about hell?",
            "Hell is a consequence of human choices. Do you believe that?",
            "Hell is a place of suffering. Do you fear hell?"
          ]
        }
      ]
    },
    {
      "key": "devil",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The devil is the father of lies. What do you think about the devil?",
            "The devil is an adversary. Do you feel tempted by the devil?",
            "The devil seeks to destroy. Have you resisted the devil?"
          ]
        }
      ]
    },
    {
      "key": "angels",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Angels are messengers of God. What do you think about angels?",
            "Angels protect us. Do you believe in the protection of angels?",
            "Angels praise God. Have you been praising God?"
          ]
        }
      ]
    },
    {
      "key": "demons",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Demons are evil spirits. What do you think about demons?",
            "Demons seek evil. Do you feel oppressed by demons?",
            "Demons are defeated by the power of God. Have you sought deliverance?"
          ]
        }
      ]
    },
    {
      "key": "prophecy",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Prophecy is the word of God to his people. What do you think about prophecy?",
            "Prophecy is fulfilled. Have you observed the fulfillment of prophecies?",
            "Prophecy guides us. Have you sought the guidance of prophecy?"
          ]
        }
      ]
    },
    {
      "key": "apocalypse",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Apocalypse reveals the end times. What do you think about the Apocalypse?",
            "The Apocalypse is a book of hope for the faithful. Do you see it that way?",
            "The Apocalypse is a warning to the wicked. Have you prepared for the end?"
          ]
        }
      ]
    },
    {
      "key": "final judgment",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "We will all stand before the judgment seat of Christ. What do you think about the Final Judgment?",
            "The Final Judgment is a day of reckoning. Are you ready for that day?",
            "The Final Judgment is a day of justice. Do you trust in God's justice?"
          ]
        }
      ]
    },
    {
      "key": "heaven and hell",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Heaven and hell are eternal destinies. What do you think about heaven and hell?",
            "The choice between heaven and hell is yours. What choice have you made?",
            "Heaven is the reward of the righteous, hell is the punishment of the wicked. Do you believe that?"
          ]
        }
      ]
    },
    {
      "key": "parable",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Parables are stories with deep teachings. Which parable do you identify with the most?",
            "Parables reveal spiritual truths. What have you learned from them?",
            "Parables invite us to reflect. Have you reflected on the parables?"
          ]
        }
      ]
    },
    {
      "key": "disciples",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The disciples followed my steps. Do you consider yourself a disciple?",
            "The disciples learned and preached the word. Have you learned and shared the word?",
            "The disciples were sent to make a difference. Have you made a difference in your world?"
          ]
        }
      ]
    },
    {
      "key": "miracles",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I performed many miracles to demonstrate the power of God. Which miracle impresses you the most?",
            "Miracles are signs of God's presence. Have you seen miracles in your life?",
            "Miracles strengthen faith. Has your faith been strengthened by miracles?"
          ]
        }
      ]
    },
    {
      "key": "healing",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I came to heal the sick. Do you seek physical, emotional, or spiritual healing?",
            "Healing is a gift from God. Do you believe in the power of divine healing?",
            "Healing is a process. Are you willing to go through this process?"
          ]
        }
      ]
    },
    {
      "key": "resurrection of lazarus",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The resurrection of Lazarus demonstrated my power over death. What does this story mean to you?",
            "The resurrection of Lazarus is a foreshadowing of my own resurrection. Do you see the connection?",
            "The resurrection of Lazarus brought hope. Do you have hope in the resurrection?"
          ]
        }
      ]
    },
    {
      "key": "multiplication of the loaves",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The multiplication of the loaves demonstrated my ability to provide. What does this story mean to you?",
            "The multiplication of the loaves fed the crowd. Do you feel spiritually fed?",
            "The multiplication of the loaves is a sign of God's abundance. Do you trust in God's provision?"
          ]
        }
      ]
    },
    {
      "key": "walking on water",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Walking on water demonstrated my dominion over nature. What does this story mean to you?",
            "Walking on water inspired faith. Is your faith strong enough to walk on water?",
            "Walking on water is a sign of power. Do you recognize the power of God in your life?"
          ]
        }
      ]
    },
    {
      "key": "calming the storm",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Calming the storm demonstrated my authority over chaos. What does this story mean to you?",
            "Calming the storm brought peace. Do you seek peace in the midst of life's storms?",
            "Calming the storm is a sign of control. Do you trust in God's control over your life?"
          ]
        }
      ]
    },
    {
      "key": "samaritan woman",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "My conversation with the Samaritan woman broke down barriers. What does this story mean to you?",
            "The Samaritan woman found the truth. Do you seek the truth in all people?",
            "The Samaritan woman was transformed. Do you seek transformation in your life?"
          ]
        }
      ]
    },
    {
      "key": "good samaritan",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The parable of the Good Samaritan teaches about loving your neighbor. What does this story mean to you?",
            "The Good Samaritan showed compassion. Have you shown compassion to others?",
            "The Good Samaritan acted without prejudice. Have you acted without prejudice?"
          ]
        }
      ]
    },
    {
      "key": "prodigal son",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The parable of the Prodigal Son teaches about forgiveness and mercy. What does this story mean to you?",
            "The Father welcomed the prodigal son back. Do you feel welcomed by God?",
            "The Prodigal Son repented. Have you repented of your mistakes?"
          ]
        }
      ]
    },
    {
      "key": "sower",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The parable of the Sower teaches about the reception of the word of God. What does this story mean to you?",
            "The seed fell on different soils. What kind of soil is your heart?",
            "The parable of the Sower talks about bearing fruit. Have you produced fruit in your life?"
          ]
        }
      ]
    },
    {
      "key": "lost sheep",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The parable of the Lost Sheep teaches about the joy of finding what was lost. What does this story mean to you?",
            "The shepherd left the ninety-nine to look for one. Do you feel valued by God?",
            "The Lost Sheep was found and there was a party. Have you celebrated the victories in your life?"
          ]
        }
      ]
    },
    {
      "key": "talents",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The parable of the Talents teaches about the responsibility of using the gifts God has given us. What does this story mean to you?",
            "Have you used your talents for the glory of God?",
            "The parable of the Talents talks about reward. Do you seek the heavenly reward?"
          ]
        }
      ]
    },
    {
      "key": "mountain",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I went up the mountain to pray and teach. What does the mountain mean to you?",
            "The mountain is a place of encounter with God. Do you seek this encounter?",
            "The mountain is a place of revelation. What do you seek to reveal in your life?"
          ]
        }
      ]
    },
    {
      "key": "desert",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I spent forty days in the desert, being tempted. What does the desert mean to you?",
            "The desert is a place of trial. Have you faced trials in your life?",
            "The desert is a place of purification. Do you seek purification in your life?"
          ]
        }
      ]
    },
    {
      "key": "temple",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "My body is the temple of the Holy Spirit. What does the temple mean to you?",
            "The temple is a place of worship. Have you worshiped God in spirit and in truth?",
            "The temple is a place of encounter. Have you sought to encounter God in the temple?"
          ]
        }
      ]
    },
    {
      "key": "jerusalem",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Jerusalem, Jerusalem, you who kill the prophets. What does Jerusalem mean to you?",
            "Jerusalem is the holy city. Do you long for the heavenly Jerusalem?",
            "Jerusalem is a place of prophecy. Have you observed the fulfillment of prophecies in Jerusalem?"
          ]
        }
      ]
    },
    {
      "key": "galilee",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I spent much of my ministry in Galilee. What does Galilee mean to you?",
            "Galilee was a region of simple people. Do you identify with simple people?",
            "Galilee was the cradle of my ministry. Do you have a cradle for your ministry?"
          ]
        }
      ]
    },
    {
      "key": "judea",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I was also in Judea, where I was crucified. What does Judea mean to you?",
            "Judea was the religious center. Do you seek the religious center in your life?",
            "Judea was the place of my sacrifice. Have you made sacrifices in your life?"
          ]
        }
      ]
    },
    {
      "key": "baptism",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I was baptized by John the Baptist. What does baptism mean to you?",
            "Baptism is a sign of repentance and new life. Have you been baptized?",
            "Baptism is a step of obedience. Have you obeyed God?"
          ]
        }
      ]
    },
    {
      "key": "supper",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I instituted the Lord's Supper before my crucifixion. What does the Supper mean to you?",
            "The Supper is a memorial of my sacrifice. Do you partake of the Supper?",
            "The Supper is a time of communion. Do you have communion with the brethren?"
          ]
        }
      ]
    },
    {
      "key": "crucifixion",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I was crucified for the remission of sins. What does the crucifixion mean to you?",
            "The crucifixion is the greatest act of love. Do you recognize this love?",
            "The crucifixion is the way to salvation. Do you accept this way?"
          ]
        }
      ]
    },
    {
      "key": "resurrection",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I rose on the third day, conquering death. What does the resurrection mean to you?",
            "The resurrection is the proof of my divinity. Do you believe in my resurrection?",
            "The resurrection is the hope of eternal life. Do you have this hope?"
          ]
        }
      ]
    },
    {
      "key": "ascension",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I ascended to heaven and am at the right hand of the Father. What does the ascension mean to you?",
            "The ascension is my glorification. Do you seek the glorification of God in your life?",
            "The ascension is the promise of my return. Do you expect my return?"
          ]
        }
      ]
    },
    {
      "key": "second coming",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I will return to gather my own. What does my second coming mean to you?",
            "My second coming will be in glory. Are you prepared for it?",
            "My second coming will bring justice. Do you long for this justice?"
          ]
        }
      ]
    },
    {
      "key": "millennial kingdom",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I will establish my Millennial Kingdom on earth. What does the Millennial Kingdom mean to you?",
            "The Millennial Kingdom will be a time of peace and justice. Do you long for this time?",
            "The Millennial Kingdom will be ruled by me. Are you ready to be ruled by me?"
          ]
        }
      ]
    },
    {
      "key": "new jerusalem",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The New Jerusalem will descend from heaven. What does the New Jerusalem mean to you?",
            "The New Jerusalem will be the home of the saved. Do you seek the New Jerusalem?",
            "The New Jerusalem will be a place of glory. Do you long for this glory?"
          ]
        }
      ]
    },
    {
      "key": "eternity",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Eternity is the destiny of the soul. What does eternity mean to you?",
            "Eternity with God is the greatest reward. Do you seek this reward?",
            "Eternity is endless. Have you prepared for eternity?"
          ]
        }
      ]
    },
    {
      "key": "god",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "God is love. What does God mean to you?",
            "God is all-powerful. Do you trust in God's power?",
            "God is just. Do you trust in God's justice?",
            "God is merciful. Have you experienced God's mercy?"
          ]
        }
      ]
    },
    {
      "key": "spirit",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "God is Spirit, and those who worship him must worship in spirit and truth. What does the spirit mean to you?",
            "The spirit is the immortal part of the human being. Have you taken care of your spirit?",
            "The spirit is the connection with the divine. Have you sought this connection?"
          ]
        }
      ]
    },
    {
      "key": "soul",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "For what will it profit a man if he gains the whole world and loses his own soul? What does the soul mean to you?",
            "The soul is eternal. Have you taken care of your soul?",
            "The soul is the center of being. Have you sought peace for your soul?"
          ]
        }
      ]
    },
    {
      "key": "body",
      "rank": 6,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Your body is the temple of the Holy Spirit. How have you been taking care of your body?",
            "The body is an instrument for the glory of God. Have you used it for this purpose?",
            "The body is mortal, but the soul is eternal. Have you prioritized what is eternal?"
          ]
        }
      ]
    },
    {
      "key": "free will",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "God gave us free will to choose between good and evil. How have you used your free will?",
            "Free will is a blessing and a responsibility. Have you assumed this responsibility?",
            "Free will allows us to love God by choice. Have you chosen to love God?"
          ]
        }
      ]
    },
    {
      "key": "destiny",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The destiny of man is in the hands of God. What do you think about destiny?",
            "Destiny is shaped by our choices. Do you believe that?",
            "The final destiny is eternity. Have you prepared for your eternal destiny?"
          ]
        }
      ]
    },
    {
      "key": "purpose",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I have come that they may have life, and that they may have it more abundantly. What is your purpose in life?",
            "God's purpose for your life is good, perfect, and pleasant. Have you sought it?",
            "The purpose of life is to glorify God. Have you lived for the glory of God?"
          ]
        }
      ]
    },
    {
      "key": "meaning of life",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The meaning of life is found in God. What do you think about the meaning of life?",
            "The meaning of life is to love God and neighbor. Have you lived with this meaning?",
            "The meaning of life is eternal. Have you sought the eternal meaning of life?"
          ]
        }
      ]
    },
    {
      "key": "happiness",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Blessed are those who mourn, for they will be comforted. What does happiness mean to you?",
            "True happiness is found in God. Have you sought it?",
            "Happiness is a state of mind. Have you cultivated happiness in your heart?"
          ]
        }
      ]
    },
    {
      "key": "sadness",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Blessed are those who mourn, for they will be comforted. What does sadness mean to you?",
            "Sadness can be a path to compassion. Have you learned from your sadness?",
            "Sadness is a human emotion. How have you faced it?"
          ]
        }
      ]
    },
    {
      "key": "joy",
      "rank": 7,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The joy of the Lord is our strength. What does joy mean to you?",
            "Joy is a fruit of the Spirit. Have you manifested it in your life?",
            "Joy is a gift from God. Have you shared it with others?"
          ]
        }
      ]
    },
    {
      "key": "peace",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Peace I leave with you, my peace I give to you. What does peace mean to you?",
            "The peace that surpasses all understanding. Have you sought it?",
            "Peace is a fruit of the Spirit. Have you cultivated it in your heart?"
          ]
        }
      ]
    },
    {
      "key": "hope",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Hope is the anchor of the soul. What does hope mean to you?",
            "Hope does not disappoint. Have you kept hope?",
            "Hope is a divine gift. Have you shared it with others?"
          ]
        }
      ]
    },
    {
      "key": "charity",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The greatest of these is charity. What does charity mean to you?",
            "Charity is love in action. Have you practiced charity?",
            "Charity covers a multitude of sins. Have you been charitable?"
          ]
        }
      ]
    },
    {
      "key": "compassion",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I had compassion on the crowds. What does compassion mean to you?",
            "Compassion moves us to help our neighbor. Have you been compassionate?",
            "Compassion is a reflection of God's love. Have you manifested it in your life?"
          ]
        }
      ]
    },
    {
      "key": "humility",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Blessed are the humble in spirit. What does humility mean to you?",
            "Humility precedes honor. Have you been humble?",
            "Humility is a Christian virtue. Have you cultivated it?"
          ]
        }
      ]
    },
    {
      "key": "patience",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Patience is a fruit of the Spirit. What does patience mean to you?",
            "Patience helps us to endure trials. Have you been patient?",
            "Patience is a virtue. Have you practiced it?"
          ]
        }
      ]
    },
    {
      "key": "kindness",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Kindness is a fruit of the Spirit. What does kindness mean to you?",
            "Kindness leads us to do good. Have you been kind?",
            "Kindness is a reflection of God's character. Have you manifested it in your life?"
          ]
        }
      ]
    },
    {
      "key": "faithfulness",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Faithfulness is a fruit of the Spirit. What does faithfulness mean to you?",
            "Faithfulness keeps us firm in the faith. Have you been faithful?",
            "Faithfulness is an attribute of God. Have you been faithful to God?"
          ]
        }
      ]
    },
    {
      "key": "gentleness",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Gentleness is a fruit of the Spirit. What does gentleness mean to you?",
            "Gentleness helps us to control anger. Have you been gentle?",
            "Gentleness is a virtue. Have you cultivated it?"
          ]
        }
      ]
    },
    {
      "key": "self-control",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Self-control is a fruit of the Spirit. What does self-control mean to you?",
            "Self-control helps us to control our desires. Have you exercised self-control?",
            "Self-control is a virtue. Have you practiced it?"
          ]
        }
      ]
    },
    {
      "key": "grace",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "By grace you have been saved, through faith. What does grace mean to you?",
            "Grace is an unmerited favor from God. Have you received it?",
            "Grace enables us to live a holy life. Have you been living by grace?"
          ]
        }
      ]
    },
    {
      "key": "mercy",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Blessed are the merciful, for they will be shown mercy. What does mercy mean to you?",
            "God's mercy is infinite. Have you sought it?",
            "Mercy leads us to forgive. Have you been merciful?"
          ]
        }
      ]
    },
    {
      "key": "justice",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Seek first the Kingdom of God and His righteousness. What does justice mean to you?",
            "God's justice is perfect. Do you trust in God's justice?",
            "Justice leads us to act correctly. Have you been just?"
          ]
        }
      ]
    },
    {
      "key": "holiness",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Be holy, because I am holy. What does holiness mean to you?",
            "Holiness is a call from God. Have you sought holiness?",
            "Holiness brings us closer to God. Have you drawn closer to God?"
          ]
        }
      ]
    },
    {
      "key": "worship",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Worship the Lord in spirit and in truth. What does worship mean to you?",
            "Worship is an expression of love for God. Have you worshiped God?",
            "Worship connects us with the divine. Have you sought this connection?"
          ]
        }
      ]
    },
    {
      "key": "praise",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Praise the Lord, all you nations. What does praise mean to you?",
            "Praise is an expression of gratitude to God. Have you praised God?",
            "Praise elevates us. Have you been elevated through praise?"
          ]
        }
      ]
    },
    {
      "key": "gratitude",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "In everything give thanks. What does gratitude mean to you?",
            "Gratitude opens us to God's blessings. Have you been grateful?",
            "Gratitude transforms perspective. Have you seen the good side of things?"
          ]
        }
      ]
    },
    {
      "key": "inner peace",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Peace I leave with you, my peace I give to you. What does inner peace mean to you?",
            "Inner peace is a gift from God. Have you sought it?",
            "Inner peace frees us from anxiety. Have you found peace in your heart?"
          ]
        }
      ]
    },
    {
      "key": "inner healing",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I came to heal the brokenhearted. What does inner healing mean to you?",
            "Inner healing frees us from trauma. Have you sought healing for your emotional wounds?",
            "Inner healing restores us. Have you felt restored?"
          ]
        }
      ]
    },
    {
      "key": "liberation",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "You will know the truth, and the truth will set you free. What does liberation mean to you?",
            "Liberation from sin and oppression. Do you seek liberation in your life?",
            "Liberation is a gift from God. Have you received it?"
          ]
        }
      ]
    },
    {
      "key": "transformation",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Be transformed by the renewing of your mind. What does transformation mean to you?",
            "Transformation is a continuous process. Have you allowed yourself to be transformed?",
            "Transformation makes us more like Christ. Do you seek this likeness?"
          ]
        }
      ]
    },
    {
      "key": "renewal",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Be transformed by the renewing of your mind. What does renewal mean to you?",
            "Renewal brings us new perspectives. Have you sought renewal in your life?",
            "Renewal is a gift from God. Have you received it?"
          ]
        }
      ]
    },
    {
      "key": "repentance",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Repent, for the Kingdom of heaven is near. What does repentance mean to you?",
            "Repentance is the first step to forgiveness. Have you repented of your sins?",
            "Repentance leads us to change. Have you sought change in your life?"
          ]
        }
      ]
    },
    {
      "key": "conversion",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Unless you change and become like little children, you will never enter the Kingdom of heaven. What does conversion mean to you?",
            "Conversion is a change of direction. Have you changed your direction?",
            "Conversion leads us to God. Have you turned to God?"
          ]
        }
      ]
    },
    {
      "key": "testimony",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "You will be my witnesses. What does testimony mean to you?",
            "Testimony shares your faith. Have you shared your faith?",
            "Testimony glorifies God. Have you glorified God with your testimony?"
          ]
        }
      ]
    },
    {
      "key": "mission",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Go into all the world and preach the gospel to every creature. What is your mission in life?",
            "God's mission for your life is great. Have you sought it?",
            "Mission leads us to serve. Have you served God and neighbor?"
          ]
        }
      ]
    },
    {
      "key": "calling",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Many are called, but few are chosen. What is your calling?",
            "God's calling is to holiness. Have you answered the call?",
            "The calling leads us to a greater purpose. Have you lived for a greater purpose?"
          ]
        }
      ]
    },
    {
      "key": "vocation",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Vocation is God's calling for your life. What is your vocation?",
            "Vocation leads us to serve God. Have you served God in your vocation?",
            "Vocation is a gift. Have you cultivated it?"
          ]
        }
      ]
    },
    {
      "key": "service",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I did not come to be served, but to serve. What does service mean to you?",
            "Service to neighbor is service to God. Have you served your neighbor?",
            "Service leads us to humility. Have you been humble in your service?"
          ]
        }
      ]
    },
    {
      "key": "sacrifice",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Greater love has no one than this: to lay down one's life for one's friends. What does sacrifice mean to you?",
            "Sacrifice is an act of love. Have you made sacrifices for love?",
            "Sacrifice leads us to redemption. Do you seek redemption through sacrifice?"
          ]
        }
      ]
    },
    {
      "key": "redemption",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I was redeemed by the blood of Christ. What does redemption mean to you?",
            "Redemption frees us from sin. Have you experienced redemption?",
            "Redemption leads us to eternal life. Do you seek eternal life through redemption?"
          ]
        }
      ]
    },
    {
      "key": "covenant",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I established a new covenant in my blood. What does the covenant mean to you?",
            "God's covenant is eternal. Do you trust in God's covenant?",
            "The covenant unites us to God. Have you sought this union?"
          ]
        }
      ]
    },
    {
      "key": "promise",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "God's promises are yes and amen. What do God's promises mean to you?",
            "God's promises are faithful. Do you trust in God's promises?",
            "God's promises give us hope. Do you have hope in God's promises?"
          ]
        }
      ]
    },
    {
      "key": "blessing",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I came to bless. What does blessing mean to you?",
            "God's blessings are abundant. Have you received God's blessings?",
            "Blessings lead us to gratitude. Have you been grateful for the blessings?"
          ]
        }
      ]
    },
    {
      "key": "curse",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The curse is the absence of the blessing. What does the curse mean to you?",
            "The curse is a consequence of sin. Do you believe that?",
            "The curse can be broken by faith. Do you seek the breaking of curses in your life?"
          ]
        }
      ]
    },
    {
      "key": "temptation",
      "rank": 8,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "I was tempted in the desert. What does temptation mean to you?",
            "Temptation leads us to sin. Have you resisted temptation?",
            "Temptation can be overcome by faith. Have you sought the strength to overcome temptation?"
          ]
        }
      ]
    },
    {
      "key": "original sin",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "Original sin brought death into the world. What does original sin mean to you?",
            "Original sin separates us from God. Do you feel this distance?",
            "Original sin is redeemed by my death on the cross. Do you accept this redemption?"
          ]
        }
      ]
    },
    {
      "key": "divine grace",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "By grace you are saved. What does divine grace mean to you?",
            "Divine grace is an unmerited gift. Have you received it?",
            "Divine grace enables us to live a holy life. Have you been living by divine grace?"
          ]
        }
      ]
    },
    {
      "key": "kingdom of heaven",
      "rank": 10,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "The Kingdom of heaven is near. What does the Kingdom of heaven mean to you?",
            "The Kingdom of heaven is a place of peace and justice. Do you long for this Kingdom?",
            "The Kingdom of heaven is a gift from God. Have you sought it?"
          ]
        }
      ]
    },
    {
      "key": "new creation",
      "rank": 9,
      "rules": [
        {
          "decomp": "*",
          "reasmb": [
            "If anyone is in Christ, he is a new creation. What does the new creation mean to you?",
            "The new creation is a transformation. Have you experienced this transformation?",
            "The new creation leads us to a new life. Have you been living this new life?"
          ]
        }
      ]
    }
  ]
}